ascend 910B/results/new-omoe-ascend/minimax-m2.7/20260803_005524_util-0.90-rr15-n100/benchmark.log
============================================================
 Qwen3.5-122B Serving Benchmark (new-omoe-ascend)
============================================================
 Model/tokenizer:   /home/ma-user/work/models/minimax-m2.7
 Base URL:          http://127.0.0.1:8000
 Dataset:           /home/ma-user/work/models/ShareGPT_V3_unfiltered_cleaned_split.json
 Backend:           openai
 Num prompts:       100
 Request rates:     15 .. 15 (step 1)
 ShareGPT out len:  dataset default
 Results:           /home/ma-user/work/experiments/results/new-omoe-ascend/minimax-m2.7/20260803_005524_util-0.90-rr15-n100
============================================================
[INFO] Checking server availability...
[INFO] Server model ID: MiniMax-M2.7

>>> Benchmark request rate: 15 req/s
/home/ma-user/work/envs/vllm-0.16.1rc0-py311/lib/python3.11/site-packages/torch_npu/utils/collect_env.py:58: UserWarning: Warning: The /usr/local/Ascend/cann-8.5.2 owner does not match the current owner.
  warnings.warn(f"Warning: The {path} owner does not match the current owner.")
/home/ma-user/work/envs/vllm-0.16.1rc0-py311/lib/python3.11/site-packages/torch_npu/utils/collect_env.py:58: UserWarning: Warning: The /usr/local/Ascend/cann-8.5.2/aarch64-linux/ascend_toolkit_install.info owner does not match the current owner.
  warnings.warn(f"Warning: The {path} owner does not match the current owner.")
/home/ma-user/work/envs/vllm-0.16.1rc0-py311/lib/python3.11/site-packages/torch_npu/utils/collect_env.py:58: UserWarning: Warning: The /usr/local/Ascend/cann-8.5.2 owner does not match the current owner.
  warnings.warn(f"Warning: The {path} owner does not match the current owner.")
/home/ma-user/work/envs/vllm-0.16.1rc0-py311/lib/python3.11/site-packages/torch_npu/utils/collect_env.py:58: UserWarning: Warning: The /usr/local/Ascend/cann-8.5.2/aarch64-linux/ascend_toolkit_install.info owner does not match the current owner.
  warnings.warn(f"Warning: The {path} owner does not match the current owner.")
INFO 08-03 00:55:55 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-03 00:55:55 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 08-03 00:55:55 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 08-03 00:55:55 [__init__.py:212] Platform plugin ascend is activated
INFO 08-03 00:56:05 [__init__.py:108] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xffff24b3d300>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='sharegpt', no_stream=False, dataset_path='/home/ma-user/work/models/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='MiniMax-M2.7', input_len=None, output_len=None, tokenizer='/home/ma-user/work/models/minimax-m2.7', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=15.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['framework=new-omoe-ascend', 'model=minimax-m2.7', 'request_rate=15'], result_dir='/home/ma-user/work/experiments/results/new-omoe-ascend/minimax-m2.7/20260803_005524_util-0.90-rr15-n100/rr_15', result_filename='result.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-6bb2f0b0-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 15.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [06:11<00:00,  3.72s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           15.00     
Benchmark duration (s):                  371.97    
Total input tokens:                      22815     
Total generated tokens:                  21584     
Request throughput (req/s):              0.27      
Output token throughput (tok/s):         58.03     
Peak output token throughput (tok/s):    284.00    
Peak concurrent requests:                98.00     
Total token throughput (tok/s):          119.36    
---------------Time to First Token----------------
Mean TTFT (ms):                          948.75    
Median TTFT (ms):                        918.26    
P99 TTFT (ms):                           1474.62   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          488.14    
Median TPOT (ms):                        473.25    
P99 TPOT (ms):                           629.43    
---------------Inter-token Latency----------------
Mean ITL (ms):                           472.56    
Median ITL (ms):                         468.17    
P99 ITL (ms):                            565.54    
==================================================
[OK] RR=15 -> /home/ma-user/work/experiments/results/new-omoe-ascend/minimax-m2.7/20260803_005524_util-0.90-rr15-n100/rr_15/result.json
RR=15.0: throughput=0.27 req/s, TTFT=948.8 ms, TPOT=488.14 ms
[OK] Summary JSON: /home/ma-user/work/experiments/results/new-omoe-ascend/minimax-m2.7/20260803_005524_util-0.90-rr15-n100/summary.json
[OK] Summary Markdown: /home/ma-user/work/experiments/results/new-omoe-ascend/minimax-m2.7/20260803_005524_util-0.90-rr15-n100/summary.md

============================================================
 Benchmark complete
 Results: /home/ma-user/work/experiments/results/new-omoe-ascend/minimax-m2.7/20260803_005524_util-0.90-rr15-n100
 Summary: /home/ma-user/work/experiments/results/new-omoe-ascend/minimax-m2.7/20260803_005524_util-0.90-rr15-n100/summary.json
============================================================